#### importing pandas as pd

In [22]:
import pandas as pd
import numpy as np

data = {
  "Name":["Ramu","Sravan","Naresh","Aniketh"],
  "Age":[21,22,23,98],
  "Gender":["Male","LGBTQ","MAle","Male"]
}

df = pd.DataFrame(data)
print(df)

      Name  Age Gender
0     Ramu   21   Male
1   Sravan   22  LGBTQ
2   Naresh   23   MAle
3  Aniketh   98   Male

#### accessing with keys

In [8]:
print(df.keys())

Index(['Name', 'Age', 'Gender'], dtype='object')

### printing using  iloc

In [57]:
df.iloc[:1][:]

   Name  Age Gender
0  Ramu   21   Male

In [10]:
print(df["Name"])

0       Ramu
1     Sravan
2     Naresh
3    Aniketh
Name: Name, dtype: object

### Accesing the target position

In [11]:
print(df["Name"][1])

Sravan

### df.head() function returns the first 3 data rows

In [12]:
print(df.head())

      Name  Age Gender
0     Ramu   21   Male
1   Sravan   22  LGBTQ
2   Naresh   23   MAle
3  Aniketh   98   Male

### df.tail() function returns the last data rows mentioned

In [27]:
print(df.tail())
print()
print(df.tail(1))

      Name  Age Gender
0     Ramu   21   Male
1   Sravan   22  LGBTQ
2   Naresh   23   MAle
3  Aniketh   98   Male

      Name  Age Gender
3  Aniketh   98   Male

### opening the csv file

In [23]:
csv = pd.read_csv("./transactions.csv")
print(csv)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [24]:
csv.head()

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1

In [25]:
csv.tail()

   TransactionID TransactionDate  UserID  ProductID  Quantity
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

### .info() method returns the information about the dataframe regaring the columns and total entries

In [28]:
csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     int64
 1   TransactionDate  10 non-null     object
 2   UserID           9 non-null      float64
 3   ProductID        10 non-null     int64
 4   Quantity         10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes

### Summarizes data with metrics like mean, count, min, max, etc.

In [32]:
csv.describe()

       TransactionID    UserID  ProductID   Quantity
count       10.00000  9.000000  10.000000  10.000000
mean         5.50000  3.444444   3.400000   2.400000
std          3.02765  2.127858   1.074968   1.712698
min          1.00000  1.000000   2.000000   1.000000
25%          3.25000  2.000000   2.250000   1.000000
50%          5.50000  3.000000   4.000000   2.000000
75%          7.75000  3.000000   4.000000   3.000000
max         10.00000  7.000000   5.000000   6.000000

### filtering data

In [63]:
filteredData = csv[csv["Quantity"] >= 3]
filteredData

   TransactionID TransactionDate  UserID  ProductID  Quantity
3              4      2012-08-26     1.0          2         3
5              6      2013-12-23     2.0          5         6
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

### Sorting the data and it returns the sorted dataframe

#### ascending parameter is used to mention the order of the sorting if True = ascending , False = descending

In [65]:
sortedDf = filteredData.sort_values(by=["Quantity"],ascending=[False])
sortedDf

   TransactionID TransactionDate  UserID  ProductID  Quantity
5              6      2013-12-23     2.0          5         6
9             10      2016-05-08     3.0          4         4
3              4      2012-08-26     1.0          2         3
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3

### Subsetting data

In [67]:
subset = csv[csv["Quantity"] >= 1]
subset

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

### selecting only particular rows

In [70]:
foo = [True,True,True,True,True,False,False,False,False,False]
print(csv[foo])

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1

## combine conditions using & and |

In [85]:
csv[(csv["ProductID"] == 2) & (csv["Quantity"] >= 3)]

   TransactionID TransactionDate  UserID  ProductID  Quantity
3              4      2012-08-26     1.0          2         3
7              8      2014-04-24     NaN          2         3

### Renaming the column names
### inplace=True: Updates the DataFrame directly without needing to assign it to a new variable.

In [90]:
sortedDf.rename(columns={"TransactionID":"TiD"})
sortedDf

   TiD TransactionDate  UserID  ProductID  Quantity
5    6      2013-12-23     2.0          5         6
9   10      2016-05-08     3.0          4         4
3    4      2012-08-26     1.0          2         3
7    8      2014-04-24     NaN          2         3
8    9      2015-04-24     7.0          4         3

### Handling Missing data

In [102]:
sortedDf.isnull()

     TiD  TransactionDate  UserID  ProductID  Quantity
5  False            False   False      False     False
9  False            False   False      False     False
3  False            False   False      False     False
7  False            False   False      False     False
8  False            False   False      False     False

### filling missing field in userId

In [106]:
sortedDf["UserID"].fillna("156",inplace=True)
sortedDf

   TiD TransactionDate UserID  ProductID  Quantity
5    6      2013-12-23    2.0          5         6
9   10      2016-05-08    3.0          4         4
3    4      2012-08-26    1.0          2         3
7    8      2014-04-24    156          2         3
8    9      2015-04-24    7.0          4         3

### dropping the fields whose value is empty

## datetime module

In [109]:
from datetime import datetime

### priting the current date

In [116]:
print(pd.to_datetime(datetime.now()))

2025-01-28 15:41:07.230440